# DuctNetwork Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MechanicalSystem..::..DuctNetwork Property
MechanicalSystem Class See Also
---
The ducts and fittings contained within the system.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementSet DuctNetwork { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DuctNetwork As ElementSet
	Get
```

Visual C++
---
```text
public:
property ElementSet^ DuctNetwork {
	ElementSet^ get ();
}
```

# Remarks
The return value doesn't include terminals or equipments, the ducts and fittings are returned in no particular order.
# See Also
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace